import type { BlogPost } from '@/types/BlogPost';

export const blogPosts: BlogPost[] = [
  {
    id: 1,
    title: 'بررسی آیفون 17 پرو مکس؛ قهرمان یا استقامت یا غول بی‌احساس؟',
    description:
      'سال‌هاست که در سکوت ابرهای کوپرتینو جنگ داخلی میان طراحان و مهندسان اپل جریان دارد...',
    image: '/images/blogs/blog1.webp',
    date: '۱۴۰۴/۰۹/۲۹',
  },
  {
    id: 2,
    title: 'چرا ۱۳ کشور با هم متحد شدند تا این میکروسکوپ پول‌پیکر را بسازند؟',
    description:
      'درخت‌های آرام و سرسبز لوند سوئد، سازه‌ای مدرن و عظیم سر برآورده که قرار است نگاه بشر...',
    image: '/images/blogs/blog2.webp',
    date: '۱۴۰۴/۰۹/۲۹',
  },
  {
    id: 3,
    title: 'وقتی هوش مصنوعی برای یادگیری مهارت جدید حافظه‌اش را پاک می‌کند',
    description:
      'تصور کنید یک جمعه رگودار، شما با این قطعات یکبار ماشین می‌سازید و بار دیگر هواپیما...',
    image: '/images/blogs/blog3.webp',
    date: '۱۴۰۴/۰۹/۲۹',
  },
  {
    id: 4,
    title: 'اطلس جدید دانشمندان ساختمان تاریکی را به تصویر می‌کشد',
    description:
      'گروهی از پژوهشگران جدیدترین یافته‌های خود را درباره فناوری و دنیای آینده منتشر کردند...',
    image: '/images/blogs/blog4.webp',
    date: '۱۴۰۴/۰۹/۲۹',
  },
  {
    id: 5,
    title: 'آینده فروشگاه‌های اینترنتی با هوش مصنوعی',
    description:
      'هوش مصنوعی در حال تغییر تجربه خرید آنلاین و نحوه انتخاب محصولات توسط کاربران است...',
    image: '/images/blogs/blog5.webp',
    date: '۱۴۰۴/۰۹/۲۸',
  },
];
